ЗАДАЧА 2 
Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
24

# count = int(input())
# if  count % 6:
#     print("The data is incorrect)
# else:
#     k = 2 * count // 3
#     p = s = count // 6
#     print(p, k, s)

ЗАДАЧА 4 
 Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

*Пример:*

6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10


ЗАДАЧА 6:
Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no
# VAR1
# ticket_num = int(input())
# sum_first = 0
# sum_second = 0
# while ticket_num:
#      digit = ticket_num % 10
#      if ticket_num > 999:
#         sum_first += digit
#      else:
#         sum_second += digit
#      ticket_num //= 10
# print(f"The ticket is lucky: {sum_first == sum_second} ) 


# VAR2
# ticket_num = int(input())
# sum_first = int(ticket_num[0]) + int(ticket_num[1]) + int(ticket_num[2])
# sum_second = int(ticket_num[3]) + int(ticket_num[4]) + int(ticket_num[5])
# print(f"The ticket is lucky: {sum_first == sum_second} )

ЗАДАЧА 8 
Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

*Пример*

3 2 4 -> yes
3 2 1 -> no

# n = int(input())
# m = int(input())
# k = int(input())
# if(k % n == 0 or k % m == 0) and k < m * n
#   print("Yes")
# else:
#   print("No")